Repository: rzaps/tinggo
Catalog: locale/ht/LC_MESSAGES/django.po
Languages: ht

source: Sign In
ht: Konekte

source: Welcome Back!
ht: Byenveni ankò!

source: Sign in to your TingGo account
ht: Konekte nan kont TingGo ou

source: Email
ht: Imèl

source: Enter your email
ht: Antre imèl ou

source: Password
ht: Modpas

source: Enter your password
ht: Antre modpas ou

source: Forgot your password?
ht: Ou bliye modpas ou?

source: Don't have an account?
ht: Ou pa gen kont?

source: Sign up
ht: Enskri

source: Sign Up
ht: Enskri

source: Create your TingGo account
ht: Kreye kont TingGo ou

source: Join our cultural community and start your journey
ht: Rantre nan kominote kiltirèl nou epi kòmanse vwayaj ou

source: Please correct the errors below.
ht: Tanpri korije erè yo ki anba a.

source: First name
ht: Non

source: Enter your first name
ht: Antre non ou

source: Last name
ht: Siyati

source: Enter your last name
ht: Antre siyati ou

source: Role
ht: Wòl

source: Language
ht: Lang

source: Password must be at least 6 characters long.
ht: Modpas la dwe gen omwen 6 karaktè.

source: Confirm password
ht: Konfime modpas

source: Confirm your password
ht: Konfime modpas ou

source: I agree to the
ht: Mwen dakò ak

source: Terms of Service
ht: Tèm Sèvis yo

source: Create Account
ht: Kreye Kont

source: OR
ht: OSWA

source: Already have an account?
ht: Ou deja gen kont?

source: Sign in
ht: Konekte

source: Reset Password
ht: Reyajiste Modpas

source: Enter your email address and we'll send you a link to reset your password.
ht: Antre adrès imèl ou epi nou ap voye yon lyen pou reyajiste modpas ou.

source: Enter your email address
ht: Antre adrès imèl ou

source: Send Reset Link
ht: Voye Lyen Reyajistman

source: Remember your password?
ht: Ou sonje modpas ou?

source: Welcome to TingGo
ht: Byenveni nan TingGo

source: Discover and connect with cultural experiences
ht: Dekouvri epi konekte ak eksperyans kiltirèl

source: Get Started
ht: Kòmanse

source: About TingGo
ht: Sou TingGo

source: TingGo is a platform that connects people with cultural experiences, events, and communities.
ht: TingGo se yon platfòm ki konekte moun ak eksperyans kiltirèl, evènman, ak kominote.

source: Features
ht: Karaktè

source: Cultural Events
ht: Evènman Kiltirèl

source: Discover and participate in cultural events
ht: Dekouvri epi patisipe nan evènman kiltirèl

source: Community
ht: Kominote

source: Connect with like-minded people
ht: Konekte ak moun ki gen menm panse

source: Experiences
ht: Eksperyans

source: Share and discover cultural experiences
ht: Pataje epi dekouvri eksperyans kiltirèl

source: Join Our Community
ht: Rantre nan Kominote Nou

source: Start your cultural journey today
ht: Kòmanse vwayaj kiltirèl ou jounen an

source: Sign Up Now
ht: Enskri Kounye a

source: Home
ht: Kay

source: Dashboard
ht: Tablèt

source: Profile
ht: Pwofil

source: Logout
ht: Dekonekte

source: Login
ht: Konekte

source: Administrator
ht: Administratè

source: Event Organizer
ht: Òganizatè Evènman

source: Event Participant
ht: Patisipan Evènman

source: Vendor/Partner
ht: Vandè/Patnè

source: Experience Host
ht: Moun ki Resevwa Eksperyans

source: email address
ht: adrès imèl

source: phone number
ht: nimewo telefòn

source: user role
ht: wòl itilizatè

source: verified
ht: verifye

source: active
ht: aktif

source: bio
ht: biyografi

source: country
ht: peyi

source: city
ht: vil

source: preferred language
ht: lang prefere

source: username
ht: non itilizatè

source: user
ht: itilizatè

source: users
ht: itilizatè

source: user profile
ht: pwofil itilizatè

source: user profiles
ht: pwofil itilizatè

source: website
ht: sit entènèt

source: email notifications
ht: notifikasyon imèl

source: push notifications
ht: notifikasyon pouse

source: business name
ht: non biznis

source: business description
ht: deskripsyon biznis
